-- Практическая работа №3
-- Проект: Каталог электроники
--  База данных: electronics_catalog

-- Задание 1. Самый дорогой товар
SELECT "бренд", "модель", "цена"
FROM "Товар"
ORDER BY "цена" DESC
LIMIT 1;

-- Задание 2. Самый дешёвый товар
SELECT "бренд", "модель", "цена"
FROM "Товар"
ORDER BY "цена" ASC
LIMIT 1;

-- Задание 3. Товары бренда Samsung
SELECT "бренд", "модель", "цена"
FROM "Товар"
WHERE "бренд" = 'Samsung';

-- Задание 4. Поиск товаров по названию
-- В исходных данных бренды и модели записаны латиницей,
-- поэтому ищем латинскую букву o.
SELECT "бренд", "модель"
FROM "Товар"
WHERE LOWER(CONCAT("бренд", ' ', "модель")) LIKE '%o%';

-- Задание 5. Все заказы
SELECT "id", "дата", "клиент", "товар_id", "количество"
FROM "Заказ"
ORDER BY "id";

-- Задание 6. Заказы Иванова Ивана Ивановича
SELECT *
FROM "Заказ"
WHERE "клиент" = 'Иванов Иван Иванович';

-- Задание 7. Заказы с названиями товаров
SELECT
    z."дата",
    z."клиент",
    t."бренд",
    t."модель",
    z."количество"
FROM "Заказ" AS z
JOIN "Товар" AS t
    ON z."товар_id" = t."id";

-- Задание 8. Общая сумма всех заказов
SELECT SUM(t."цена" * z."количество") AS общая_сумма
FROM "Заказ" AS z
JOIN "Товар" AS t
    ON z."товар_id" = t."id";

-- Задание 9. Количество заказов по клиентам
SELECT "клиент", COUNT(*) AS количество_заказов
FROM "Заказ"
GROUP BY "клиент"
ORDER BY "клиент";

-- Задание 10. Товары с низким остатком
-- Запрос помогает контролировать наличие электроники на складе.
SELECT "бренд", "модель", "количество"
FROM "Товар"
WHERE "количество" <= 3
ORDER BY "количество" ASC;